backend/app/controllers/api/v1/artists_controller.rb

SELECT "artists".* FROM "artists"
---
    def index
        artists = Artist.all

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "August Renoir"], ["created_at", "2021-02-22 17:19:55.105445"], ["updated_at", "2021-02-22 17:19:55.105445"]]
---
    def create
        # binding.pry
        artist = Artist.new(artist_params)
        if artist.save