backend/app/controllers/api/v1/artworks_controller.rb

INSERT INTO "artworks" ("title", "image", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
    def create
        if params[:artist_name]
            binding.pry

            # artist = Artist.create(artist_name)
        end
        artwork = Artwork.new(artwork_params)
        if artwork.save